# Chapter 12. Reporting and Reshaping

In [1]:
%load_ext sql
%sql postgresql://sql-cookbook:sql-cookbook@0.0.0.0:5432/sql-cookbook

## 12.1 Pivoting a Result Set into One Row

In [2]:
%%sql
select sum((deptno = 10)::int) as deptno_10,
       sum((deptno = 20)::int) as deptno_20,
       sum((deptno = 30)::int) as deptno_30
from emp;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
1 rows affected.

[(3, 5, 6)]

In [3]:
%%sql
create extension if not exists tablefunc;

select *
from crosstab($$
    select 1             as row,
           deptno,
           count(*)::int as count
    from emp
    group by deptno
    order by deptno;
$$) as ct(row int, deptno_10 int, deptno_20 int, deptno_30 int);

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
Done.
1 rows affected.

[(1, 3, 5, 6)]

## 12.2 Pivoting a Result Set into Multiple Rows

In [4]:
%%sql
create extension if not exists tablefunc;

select clerk     as clerks,
       analyst   as analysts,
       manager   as mgrs,
       president as prez,
       salesman  as sales
from crosstab($$
    select row_number() over (partition by job order by ename) as row,
           job,
           ename
    from emp
    order by row;
$$, $$
    select distinct job from emp order by job;
$$) as ct(row bigint, analyst text, clerk text, manager text, president text, salesman text);

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
Done.
4 rows affected.

[('ADAMS', 'FORD', 'BLAKE', 'KING', 'ALLEN'),
 ('JAMES', 'SCOTT', 'CLARK', None, 'MARTIN'),
 ('MILLER', None, 'JONES', None, 'TURNER'),
 ('SMITH', None, None, None, 'WARD')]

## 12.3 Reverse Pivoting a Result Set

In [5]:
%%sql
with data as (
    select *
    from (values (3, 5, 6))
             as t(deptno_10, deptno_20, deptno_30)
)
select 10        as deptno,
       deptno_10 as count
from data
union
select 20, deptno_20
from data
union
select 30, deptno_30
from data;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
3 rows affected.

[(10, 3), (30, 6), (20, 5)]

## 12.4 Reverse Pivoting a Result Set into One Column

In [6]:
%%sql
select unnest(array [ename, job, sal::text, null]) as emps
from emp
where deptno = 10;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
12 rows affected.

[('CLARK',),
 ('MANAGER',),
 ('2450',),
 (None,),
 ('KING',),
 ('PRESIDENT',),
 ('5000',),
 (None,),
 ('MILLER',),
 ('CLERK',),
 ('1300',),
 (None,)]

## 12.5 Suppressing Repeating Values from a Result Set

In [7]:
%%sql
select case
           when row_number() over (partition by deptno order by ename) > 1 then ''
           else deptno::text
           end as deptno,
       ename
from emp;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
14 rows affected.

[('10', 'CLARK'),
 ('', 'KING'),
 ('', 'MILLER'),
 ('20', 'ADAMS'),
 ('', 'FORD'),
 ('', 'JONES'),
 ('', 'SCOTT'),
 ('', 'SMITH'),
 ('30', 'ALLEN'),
 ('', 'BLAKE'),
 ('', 'JAMES'),
 ('', 'MARTIN'),
 ('', 'TURNER'),
 ('', 'WARD')]

In [8]:
%%sql
select case
           when lag(deptno) over (partition by deptno order by ename) = deptno then ''
           else deptno::text
           end as deptno,
       ename
from emp;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
14 rows affected.

[('10', 'CLARK'),
 ('', 'KING'),
 ('', 'MILLER'),
 ('20', 'ADAMS'),
 ('', 'FORD'),
 ('', 'JONES'),
 ('', 'SCOTT'),
 ('', 'SMITH'),
 ('30', 'ALLEN'),
 ('', 'BLAKE'),
 ('', 'JAMES'),
 ('', 'MARTIN'),
 ('', 'TURNER'),
 ('', 'WARD')]

## 12.6 Pivoting a Result Set to Facilitate Inter-Row Calculations

In [9]:
%%sql
with salaries as (
    select sum(case deptno when 10 then sal end) as d10_sal,
           sum(case deptno when 20 then sal end) as d20_sal,
           sum(case deptno when 30 then sal end) as d30_sal
    from emp
)
select d20_sal - d10_sal as d20_10_diff,
       d20_sal - d30_sal as d20_30_dif
from salaries;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
1 rows affected.

[(2125, 1475)]

## 12.7 Creating Buckets of Data, of a Fixed Size

In [10]:
%%sql
select ceil(row_number() over (order by empno) / 5.) as bucket,
       empno,
       ename
from emp;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
14 rows affected.

[(Decimal('1'), 7369, 'SMITH'),
 (Decimal('1'), 7499, 'ALLEN'),
 (Decimal('1'), 7521, 'WARD'),
 (Decimal('1'), 7566, 'JONES'),
 (Decimal('1'), 7654, 'MARTIN'),
 (Decimal('2'), 7698, 'BLAKE'),
 (Decimal('2'), 7782, 'CLARK'),
 (Decimal('2'), 7788, 'SCOTT'),
 (Decimal('2'), 7839, 'KING'),
 (Decimal('2'), 7844, 'TURNER'),
 (Decimal('3'), 7876, 'ADAMS'),
 (Decimal('3'), 7900, 'JAMES'),
 (Decimal('3'), 7902, 'FORD'),
 (Decimal('3'), 7934, 'MILLER')]

## 12.8 Creating a Predefined Number of Buckets

In [11]:
%%sql
select ntile(4) over (order by empno) as bucket,
       empno,
       ename
from emp;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
14 rows affected.

[(1, 7369, 'SMITH'),
 (1, 7499, 'ALLEN'),
 (1, 7521, 'WARD'),
 (1, 7566, 'JONES'),
 (2, 7654, 'MARTIN'),
 (2, 7698, 'BLAKE'),
 (2, 7782, 'CLARK'),
 (2, 7788, 'SCOTT'),
 (3, 7839, 'KING'),
 (3, 7844, 'TURNER'),
 (3, 7876, 'ADAMS'),
 (4, 7900, 'JAMES'),
 (4, 7902, 'FORD'),
 (4, 7934, 'MILLER')]

## 12.9 Creating Horizontal Histograms

In [12]:
%%sql
select deptno,
       repeat('*', count(*)::int) as count
from emp
group by deptno
order by deptno;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
3 rows affected.

[(10, '***'), (20, '*****'), (30, '******')]

## 12.10 Creating Vertical Histograms

In [13]:
%%sql
with
    employees as (
        select sum((deptno = 10)::int) as d10,
               sum((deptno = 20)::int) as d20,
               sum((deptno = 30)::int) as d30
        from emp
    ),
    rows as (
        select distinct row_number() over (partition by deptno) as row_number
        from emp
        order by row_number desc
    )
select case when d10 >= row_number then '*' else '' end as d10,
       case when d20 >= row_number then '*' else '' end as d20,
       case when d30 >= row_number then '*' else '' end as d30
from employees, rows;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
6 rows affected.

[('', '', '*'),
 ('', '*', '*'),
 ('', '*', '*'),
 ('*', '*', '*'),
 ('*', '*', '*'),
 ('*', '*', '*')]

## 12.11 Returning Non-GROUP BY Columns

In [14]:
%%sql
with emp as (
    select *,
           max(sal) over (partition by deptno) as top_sal_in_dept,
           max(sal) over (partition by job)    as top_sal_in_job,
           min(sal) over (partition by deptno) as low_sal_in_dept,
           min(sal) over (partition by job)    as low_sal_in_job
    from emp
)
select deptno,
       ename,
       job,
       sal,
       case sal
           when top_sal_in_dept then 'TOP SAL IN DEPT'
           when low_sal_in_dept then 'LOW SAL IN DEPT'
           else ''
           end as dept_status,
       case sal
           when top_sal_in_job then 'TOP SAL IN JOB'
           when low_sal_in_job then 'LOW SAL IN JOB'
           else ''
           end as job_status
from emp
order by deptno, job, ename;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
14 rows affected.

[(10, 'MILLER', 'CLERK', 1300, 'LOW SAL IN DEPT', 'TOP SAL IN JOB'),
 (10, 'CLARK', 'MANAGER', 2450, '', 'LOW SAL IN JOB'),
 (10, 'KING', 'PRESIDENT', 5000, 'TOP SAL IN DEPT', 'TOP SAL IN JOB'),
 (20, 'FORD', 'ANALYST', 3000, 'TOP SAL IN DEPT', 'TOP SAL IN JOB'),
 (20, 'SCOTT', 'ANALYST', 3000, 'TOP SAL IN DEPT', 'TOP SAL IN JOB'),
 (20, 'ADAMS', 'CLERK', 1100, '', ''),
 (20, 'SMITH', 'CLERK', 800, 'LOW SAL IN DEPT', 'LOW SAL IN JOB'),
 (20, 'JONES', 'MANAGER', 2975, '', 'TOP SAL IN JOB'),
 (30, 'JAMES', 'CLERK', 950, 'LOW SAL IN DEPT', ''),
 (30, 'BLAKE', 'MANAGER', 2850, 'TOP SAL IN DEPT', ''),
 (30, 'ALLEN', 'SALESMAN', 1600, '', 'TOP SAL IN JOB'),
 (30, 'MARTIN', 'SALESMAN', 1250, '', 'LOW SAL IN JOB'),
 (30, 'TURNER', 'SALESMAN', 1500, '', ''),
 (30, 'WARD', 'SALESMAN', 1250, '', 'LOW SAL IN JOB')]

## 12.12 Calculating Simple Subtotals

In [15]:
%%sql
select case grouping(job)
           when 1 then 'TOTAL'
           else job
           end  as job,
       sum(sal) as sal
from emp
group by rollup (job)
order by job;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
6 rows affected.

[('ANALYST', 6000),
 ('CLERK', 4150),
 ('MANAGER', 8275),
 ('PRESIDENT', 5000),
 ('SALESMAN', 5600),
 ('TOTAL', 29025)]

In [16]:
%%sql
select coalesce(job, 'TOTAL') as job,
       sum(sal)               as sal
from emp
group by rollup (job)
order by job;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
6 rows affected.

[('ANALYST', 6000),
 ('CLERK', 4150),
 ('MANAGER', 8275),
 ('PRESIDENT', 5000),
 ('SALESMAN', 5600),
 ('TOTAL', 29025)]

## 12.13 Calculating Subtotals for All Possible Expression Combinations

In [17]:
%%sql
select deptno,
       job,
       sum(sal) as sal,
       case ~grouping(deptno, job)::bit(2)
           when b'11' then 'TOTAL BY DEPT AND JOB'
           when b'10' then 'TOTAL BY DEPT'
           when b'01' then 'TOTAL BY JOB'
           when b'00' then 'GRAND TOTAL FOR TABLE'
           end  as category
from emp
group by cube (deptno, job)
order by grouping(deptno, job), deptno, job;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
18 rows affected.

[(10, 'CLERK', 1300, 'TOTAL BY DEPT AND JOB'),
 (10, 'MANAGER', 2450, 'TOTAL BY DEPT AND JOB'),
 (10, 'PRESIDENT', 5000, 'TOTAL BY DEPT AND JOB'),
 (20, 'ANALYST', 6000, 'TOTAL BY DEPT AND JOB'),
 (20, 'CLERK', 1900, 'TOTAL BY DEPT AND JOB'),
 (20, 'MANAGER', 2975, 'TOTAL BY DEPT AND JOB'),
 (30, 'CLERK', 950, 'TOTAL BY DEPT AND JOB'),
 (30, 'MANAGER', 2850, 'TOTAL BY DEPT AND JOB'),
 (30, 'SALESMAN', 5600, 'TOTAL BY DEPT AND JOB'),
 (10, None, 8750, 'TOTAL BY DEPT'),
 (20, None, 10875, 'TOTAL BY DEPT'),
 (30, None, 9400, 'TOTAL BY DEPT'),
 (None, 'ANALYST', 6000, 'TOTAL BY JOB'),
 (None, 'CLERK', 4150, 'TOTAL BY JOB'),
 (None, 'MANAGER', 8275, 'TOTAL BY JOB'),
 (None, 'PRESIDENT', 5000, 'TOTAL BY JOB'),
 (None, 'SALESMAN', 5600, 'TOTAL BY JOB'),
 (None, None, 29025, 'GRAND TOTAL FOR TABLE')]

## 12.14 Identifying Rows That Are Not Subtotals

In [18]:
%%sql
select deptno,
       job,
       sum(sal)         as sal,
       grouping(deptno) as deptno_subtotals,
       grouping(job)    as job_subtotals
from emp
group by cube (deptno, job)
order by deptno nulls first,
         job nulls first;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
18 rows affected.

[(None, None, 29025, 1, 1),
 (None, 'ANALYST', 6000, 1, 0),
 (None, 'CLERK', 4150, 1, 0),
 (None, 'MANAGER', 8275, 1, 0),
 (None, 'PRESIDENT', 5000, 1, 0),
 (None, 'SALESMAN', 5600, 1, 0),
 (10, None, 8750, 0, 1),
 (10, 'CLERK', 1300, 0, 0),
 (10, 'MANAGER', 2450, 0, 0),
 (10, 'PRESIDENT', 5000, 0, 0),
 (20, None, 10875, 0, 1),
 (20, 'ANALYST', 6000, 0, 0),
 (20, 'CLERK', 1900, 0, 0),
 (20, 'MANAGER', 2975, 0, 0),
 (30, None, 9400, 0, 1),
 (30, 'CLERK', 950, 0, 0),
 (30, 'MANAGER', 2850, 0, 0),
 (30, 'SALESMAN', 5600, 0, 0)]

## 12.15 Using Case Expressions to Flag Rows

In [19]:
%%sql
select ename,
       (job = 'CLERK')::int     as is_clerk,
       (job = 'SALESMAN')::int  as is_sales,
       (job = 'MANAGER')::int   as is_mgr,
       (job = 'ANALYST')::int   as is_analyst,
       (job = 'PRESIDENT')::int as is_prez
from emp
order by ename;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
14 rows affected.

[('ADAMS', 1, 0, 0, 0, 0),
 ('ALLEN', 0, 1, 0, 0, 0),
 ('BLAKE', 0, 0, 1, 0, 0),
 ('CLARK', 0, 0, 1, 0, 0),
 ('FORD', 0, 0, 0, 1, 0),
 ('JAMES', 1, 0, 0, 0, 0),
 ('JONES', 0, 0, 1, 0, 0),
 ('KING', 0, 0, 0, 0, 1),
 ('MARTIN', 0, 1, 0, 0, 0),
 ('MILLER', 1, 0, 0, 0, 0),
 ('SCOTT', 0, 0, 0, 1, 0),
 ('SMITH', 1, 0, 0, 0, 0),
 ('TURNER', 0, 1, 0, 0, 0),
 ('WARD', 0, 1, 0, 0, 0)]

## 12.16 Creating a Sparse Matrix

In [20]:
%%sql
select case deptno when 10 then ename else '' end       as d10,
       case deptno when 20 then ename else '' end       as d20,
       case deptno when 30 then ename else '' end       as d30,
       case job when 'CLERK' then ename else '' end     as clerks,
       case job when 'MANAGER' then ename else '' end   as mgrs,
       case job when 'PRESIDENT' then ename else '' end as prez,
       case job when 'ANALYST' then ename else '' end   as anals,
       case job when 'SALESMAN' then ename else '' end  as sales
from emp;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
14 rows affected.

[('', 'SMITH', '', 'SMITH', '', '', '', ''),
 ('', '', 'ALLEN', '', '', '', '', 'ALLEN'),
 ('', '', 'WARD', '', '', '', '', 'WARD'),
 ('', 'JONES', '', '', 'JONES', '', '', ''),
 ('', '', 'MARTIN', '', '', '', '', 'MARTIN'),
 ('', '', 'BLAKE', '', 'BLAKE', '', '', ''),
 ('CLARK', '', '', '', 'CLARK', '', '', ''),
 ('', 'SCOTT', '', '', '', '', 'SCOTT', ''),
 ('KING', '', '', '', '', 'KING', '', ''),
 ('', '', 'TURNER', '', '', '', '', 'TURNER'),
 ('', 'ADAMS', '', 'ADAMS', '', '', '', ''),
 ('', '', 'JAMES', 'JAMES', '', '', '', ''),
 ('', 'FORD', '', '', '', '', 'FORD', ''),
 ('MILLER', '', '', 'MILLER', '', '', '', '')]

## 12.17 Grouping Rows by Units of Time

In [21]:
%%sql
with
    trx_log as (
        select *
        from (values (1, '28-JUL-2020 19:03:07'::timestamp, 44),
                     (2, '28-JUL-2020 19:03:08'::timestamp, 18),
                     (3, '28-JUL-2020 19:03:09'::timestamp, 23),
                     (4, '28-JUL-2020 19:03:10'::timestamp, 29),
                     (5, '28-JUL-2020 19:03:11'::timestamp, 27),
                     (6, '28-JUL-2020 19:03:12'::timestamp, 45),
                     (7, '28-JUL-2020 19:03:13'::timestamp, 45),
                     (8, '28-JUL-2020 19:03:14'::timestamp, 32),
                     (9, '28-JUL-2020 19:03:15'::timestamp, 41),
                     (10, '28-JUL-2020 19:03:16'::timestamp, 15),
                     (11, '28-JUL-2020 19:03:17'::timestamp, 24),
                     (12, '28-JUL-2020 19:03:18'::timestamp, 47),
                     (13, '28-JUL-2020 19:03:19'::timestamp, 37),
                     (14, '28-JUL-2020 19:03:20'::timestamp, 48),
                     (15, '28-JUL-2020 19:03:21'::timestamp, 46),
                     (16, '28-JUL-2020 19:03:22'::timestamp, 44),
                     (17, '28-JUL-2020 19:03:23'::timestamp, 36),
                     (18, '28-JUL-2020 19:03:24'::timestamp, 41),
                     (19, '28-JUL-2020 19:03:25'::timestamp, 33),
                     (20, '28-JUL-2020 19:03:26'::timestamp, 19))
                 as t(trx_id, trx_date, trx_cnt)
    ),
    windows as (
        select *, 1 + floor(extract(second from trx_date - min(trx_date) over (order by trx_date)) / 5)::int as "5s_window"
        from trx_log
    )
select "5s_window",
       min(trx_date) as trx_start,
       max(trx_date) as trx_end,
       sum(trx_cnt)  as total
from windows
group by "5s_window"
order by "5s_window";

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
4 rows affected.

[(1, datetime.datetime(2020, 7, 28, 19, 3, 7), datetime.datetime(2020, 7, 28, 19, 3, 11), 141),
 (2, datetime.datetime(2020, 7, 28, 19, 3, 12), datetime.datetime(2020, 7, 28, 19, 3, 16), 178),
 (3, datetime.datetime(2020, 7, 28, 19, 3, 17), datetime.datetime(2020, 7, 28, 19, 3, 21), 202),
 (4, datetime.datetime(2020, 7, 28, 19, 3, 22), datetime.datetime(2020, 7, 28, 19, 3, 26), 173)]

## 12.18 Performing Aggregations over Different Groups/Partitions Simultaneously

In [22]:
%%sql
select ename,
       deptno,
       count(*) over (partition by deptno) as deptno_cnt,
       job,
       count(*) over (partition by job)    as job_cnt,
       count(*) over ()                    as total
from emp
order by deptno, ename;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
14 rows affected.

[('CLARK', 10, 3, 'MANAGER', 3, 14),
 ('KING', 10, 3, 'PRESIDENT', 1, 14),
 ('MILLER', 10, 3, 'CLERK', 4, 14),
 ('ADAMS', 20, 5, 'CLERK', 4, 14),
 ('FORD', 20, 5, 'ANALYST', 2, 14),
 ('JONES', 20, 5, 'MANAGER', 3, 14),
 ('SCOTT', 20, 5, 'ANALYST', 2, 14),
 ('SMITH', 20, 5, 'CLERK', 4, 14),
 ('ALLEN', 30, 6, 'SALESMAN', 4, 14),
 ('BLAKE', 30, 6, 'MANAGER', 3, 14),
 ('JAMES', 30, 6, 'CLERK', 4, 14),
 ('MARTIN', 30, 6, 'SALESMAN', 4, 14),
 ('TURNER', 30, 6, 'SALESMAN', 4, 14),
 ('WARD', 30, 6, 'SALESMAN', 4, 14)]

## 12.19 Performing Aggregations over a Moving Range of Values

In [23]:
%%sql
select hiredate,
       sal,
       sum(sal) over (order by hiredate range between '90 day' preceding and current row) as spending_pattern
from emp;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
14 rows affected.

[(datetime.date(2005, 12, 17), 800, 800),
 (datetime.date(2006, 2, 20), 1600, 2400),
 (datetime.date(2006, 2, 22), 1250, 3650),
 (datetime.date(2006, 4, 2), 2975, 5825),
 (datetime.date(2006, 5, 1), 2850, 8675),
 (datetime.date(2006, 6, 9), 2450, 8275),
 (datetime.date(2006, 9, 8), 1500, 1500),
 (datetime.date(2006, 9, 28), 1250, 2750),
 (datetime.date(2006, 11, 17), 5000, 7750),
 (datetime.date(2006, 12, 3), 3000, 11700),
 (datetime.date(2006, 12, 3), 950, 11700),
 (datetime.date(2007, 1, 23), 1300, 10250),
 (datetime.date(2007, 12, 9), 3000, 3000),
 (datetime.date(2008, 1, 12), 1100, 4100)]

## 12.20 Pivoting a Result Set with Subtotals

In [24]:
%%sql
with report as (
    select deptno,
           mgr,
           sum(sal) as sal
    from emp
    where mgr is not null
    group by rollup (deptno, mgr)
    order by deptno, mgr
)
select mgr,
       sum(case deptno when 10 then sal else 0 end) as dept10,
       sum(case deptno when 20 then sal else 0 end) as dept20,
       sum(case deptno when 30 then sal else 0 end) as dept30,
       sum(case when deptno is null then sal end)   as total
from report
group by mgr
order by mgr;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
7 rows affected.

[(7566, Decimal('0'), Decimal('6000'), Decimal('0'), None),
 (7698, Decimal('0'), Decimal('0'), Decimal('6550'), None),
 (7782, Decimal('1300'), Decimal('0'), Decimal('0'), None),
 (7788, Decimal('0'), Decimal('1100'), Decimal('0'), None),
 (7839, Decimal('2450'), Decimal('2975'), Decimal('2850'), None),
 (7902, Decimal('0'), Decimal('800'), Decimal('0'), None),
 (None, Decimal('3750'), Decimal('10875'), Decimal('9400'), Decimal('24025'))]